Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: This is not strictly speaking the same thing as including the file and having it inherit the parent file' s variable scope; the script is actually being run on the remote server and the result is then being included into the local script.
es: Cuando se llama a main.html en PHP3, generará un error del intérprete en la linea 2; no se puede capturar el valor de un include() en PHP3.

source: Example 12-5. include() through HTTP
es: ?php include( 'test.inc '); echo "De vuelta en main.html br \n";?

source: ?php / * This example assumes that www.example.com is configured to parse .php * * files and not .txt files.
es: Antes del return De vuelta en main.html

source: Also, 'Works' here means that the variables * * $foo and $bar are available within the included file. * / / / Won't work; file.txt wasn't handled by www.example.com as PHP include'http: / /www.example.com / file.txt?foo=1 bar=2'; / / Won't work; looks for a file named'file.php?foo=1 bar=2 'on the / / local filesystem. include'file.php?foo=1 bar=2'; / / Works. include'http: / /www.example.com / file.php?foo=1 bar=2'; $foo = 1; $bar = 2; include'file.txt'; / / Works. include'file.php'; / / Works.?
es: El error del intérprete es resultado del hecho de que la sentencia return está encerrada en un bloque de no-función dentro de test.inc.

source: Because include() and require() are special language constructs, you must enclose them within a statement block if it's inside a conditional block.
es: Cuando el return se mueve fuera del bloque, la salida es:

source: Example 12-6. include() and conditional blocks
es: Antes del return 27De vuelta en main.html

source: ?php / / This is WRONG and will not work as desired. if ($condition) include $file; else include $other; / / This is CORRECT. if ($condition) {include $file;} else {include $other;}?
es: El '27' espúreo se debe al hecho de que PHP3 no soporta devolver valores con return desde archivos como ese.

source: It is possible to execute a return() It is possible to execute a return() statement inside an included file in order to terminate processing in that file and return to the script which called it.
es: When a file is include() ed, the code it contains inherits the variable scope of the line on which the include() When a file is include() ed, the code it contains inherits the variable scope of the line on which the include() occurs.

source: Also, it 's possible to return values from included files.
es: Any variables available at that line in the calling file will be available within the called file.

source: Example 12-7. include() and the return() statement
es: If the include() ed file is called via HTTP using the fopen wrappers, and if the target server interprets the target file as PHP code, variables may be passed to the include() ed file using an URL request string as used with HTTP GET.

source: return.php ?php $var = 'PHP'; return $var;? noreturn.php ?php $var = 'PHP';? testreturns.php ?php $foo = include'return.php'; echo $foo; / / prints'PHP' $bar = include'noreturn.php'; echo $bar; / / prints 1?
es: This is not strictly speaking the same thing as include() ing the file and having it inherit the parent file's variable scope; the script is actually being run on the remote server and the result is then being included into the local script.

source: Notice the difference between the above examples.
es: /* This example assumes that someserver is configured to parse .php * files and not .txt files.

source: A few other ways to "include" files into variables are with fopen(), file() or by using include() along with Output Control Functions.
es: Also, 'works' here means that the variables * $varone and $vartwo are available within the include()ed file. * / / * Won't work; file.txt wasn't handled by someserver. * / include ("http: / /someserver / file.txt?varone=1 vartwo=2"); / * Won't work; looks for a file named 'file.php?varone=1 vartwo=2 '* on the local filesystem. * / include ("file.php?varone=1 vartwo=2"); / * Works. * / include ("http: / /someserver / file.php?varone=1 vartwo=2"); $varone = 1; $vartwo = 2; include ("file.txt"); / * Works. * / include ("file.php"); / * Works. * /

source: See also require(), require_once(), include_once(), readfile(), virtual(), and include_path.
es: See also require(), require_once(), include_once(), readfile(), and virtual().

source: As the name suggests, it will be included just once.
es: This is a behavior similar to the include() statement, with the important difference that if the code from a file has already been included, it will not be included again.

source: For more examples on using require_once() and include_once(), look at the PEAR code included in the latest PHP source code distributions.
es: As mentioned in the require_once() description, the include_once() should be used in the cases in which the same file might be included and evaluated more than once during a particular execution of a script, and you want to be sure that it is included exactly once to avoid problems with function redefinitions, variable value reassignments, etc.

source: See also include(), require(), require_once(), get_required_files(), get_included_files(), readfile(), and virtual().
es: See also: require(), include(), require_once(), get_required_files(), get_included_files(), readfile(), and virtual().

source: Functions
es: Funciones

source: The behaviour of this function, the name of this function, and anything else documented about this function may change without notice in a future release of PHP.
es: ingres_autocommit() is called before opening a transaction (before the first call to ingres_query() or just after a call to ingres_rollback() or ingres_autocommit()) to switch the "autocommit "mode of the server on or off (when the script begins the autocommit mode is off).

source: ingres_connect() opens a connection with the Ingres database designated by database, which follows the syntax [node_id: :]dbname[ / svr_class].
es: If some parameters are missing, ingres_connect() uses the values in php.ini for ingres.default_database, ingres.default_user and ingres.default_password.

source: Example 1. ingres_connect() example
es: Ejemplo 1. ingres_connect() example

source: Example 2. ingres_connect() example using default link
es: Ejemplo 2. ingres_connect() example using default link

source: result_type can be INGRES_NUM for enumerated array, INGRES_ASSOC for associative array, or INGRES_BOTH (default).
es: result_type can be II_NUM for enumerated array, II_ASSOC for associative array, or II_BOTH (default).

source: Example 1. ingres_fetch_array() example
es: Ejemplo 1. ingres_fetch_array() example

source: INGRES_ASSOC, INGRES_NUM, and INGRES_BOTH.
es: II_ASSOC, II_NUM, and II_BOTH.

source: Example 1. ingres_fetch_object() example
es: Ejemplo 1. ingres_fetch_object() example

source: Example 1. ingres_fetch_row() example
es: Ejemplo 1. ingres_fetch_row() example

source: For delete, insert or update queries, ingres_num_rows() returns the number of rows affected by the query.
es: Nota:

source: Example 1. ingres_query() example
es: Ejemplo 1. ingres_query() example

source: var may be any scalar type.
es: Devuelve el valor entero de var, usando la base de conversión especificada (por defecto es base 10).

source: The base argument for intval() has no effect unless the var argument is a string.
es: No se puede usar intval() sobre arrays u objetos.

source: See also floatval(), strval(), settype() and Type juggling.
es: Ver también doubleval(), strval(), settype() y Type juggling.

source: Example 1. ip2long() Example
es: Ejemplo 1. ip2long() Example

source: Example 1. ircg_fetch_error_msg() example
es: Ejemplo 1. ircg_fetch_error_msg() example

source: Returns TRUE if var is an array, FALSE otherwise.
es: Devuelve TRUE si var es un array, y FALSE en otro caso.

source: See also is_float(), is_int(), is_integer(), is_string(), and is_object().
es: Ver también is_double(), is_float(), is_int(), is_integer(), is_real(), is_string(), is_long(), y is_object().

source: If filename is a relative filename, it will be checked relative to the current working directory.
es: Devuelve TRUE si el nombre del fichero existe y es un directorio.

source: See also chdir(), dir, opendir(), is_file() and is_link().
es: Ver también is_file() y is_link().

source: This function is an alias of is_float().
es: Ver también is_array(), is_float(), is_int(), is_integer(), is_real(), is_string(), is_long(), y is_object().

source: This function is not available on Win32.
es: Ver clearstatcache() para más detalles.

source: See also is_file() and is_link().
es: Ver también is_file() y is_link().

source: See also is_dir() and is_link().
es: Ver también is_dir() y is_link().

source: See also is_bool(), is_int(), is_integer(), is_numeric(), is_string(), is_array(), and is_object(),
es: Ver también is_double(), is_real(), is_int(), is_integer(), is_string(), is_object(), is_array(), y is_long().

source: This function is an alias of is_int().
es: Ver también is_double(), is_float(), is_int(), is_string(), is_real(), is_object(), is_array(), y is_long().

source: See also is_bool(), is_float(), is_integer(), is_numeric(), is_string(), is_array(), and is_object().
es: Ver también is_double(), is_float(), is_integer(), is_string(), is_real(), is_object(), is_array(), y is_long().

source: See also is_dir(), is_file(), and readlink().
es: Ver clearstatcache() para más detalles.

source: Returns TRUE if var is an object, FALSE otherwise.
es: Devuelve TRUE si var es un objeto, y FALSE en otro caso.

source: See also is_bool(), is_int(), is_integer(), is_float(), is_string(), and is_array().
es: Ver también is_long(), is_int(), is_integer(), is_float(), is_double(), is_real(), is_string(), y is_array().

source: Returns TRUE if the filename exists and is readable.
es: Devuelve TRUE si el fichero indicado existe y se puede leer.

source: Safe mode limitations are not taken into account.
es: Recuerda que PHP puede acceder al fichero con el identificador de usuario con el que el servidor web se ejecuta (a menudo 'nobody').

source: See also is_writable().
es: Ver también is_writeable().

source: If a variable has been unset with unset(), it will no longer be isset(). isset() will return FALSE if testing a variable that has been set to NULL.
es: Devuelve TRUE si var existe; y FALSE en otro caso.

source: For checking if constants are set use the defined() function.
es: Si una variable ha sido destruida con unset(), ya no estará definida (no será isset()).

source: This also work for elements in arrays:
es: $a = "test"; echo isset($a); / / true unset($a); echo isset($a); / / false

source: See also empty(), unset(), defined(), array_key_exists() and the error control @ operator.
es: Ver también empty() y unset().

source: Returns TRUE if var is a string, FALSE otherwise.
es: Devuelve TRUE si var es una cadena, y FALSE en otro caso.

source: See also is_bool(), is_int(), is_integer(), is_float(), is_real(), is_object(), and is_array().
es: Ver también is_long(), is_int(), is_integer(), is_float(), is_double(), is_real(), is_object(), y is_array().

source: This is an alias for is_writable()
es: No se tienen en cuenta las limitaciones de modos seguros.

source: This function is EXPERIMENTAL.
es: Este módulo es EXPERIMENTAL.

source: Use this function at your own risk.
es: Quedas avisado, y utilizar este módulo es tu responsabiliad.

source: LDAP functions
es: Funciones LDAP

source: Returns the day of the week.
es: Devuelve el día de la semana.

source: Can return a string or an integer depending on the mode.
es: Dependiendo del modo, devuelve un entero ó una cadena.

source: Calendar week modes
es: Modos para el día de la semana

source: Mode
es: Modo

source: Meaning
es: Significado

source: Returns the day number as an int (0=sunday, 1=monday, etc)
es: devuelve el día de la semana como entero (0=domingo, 1=lunes, etc)

source: Returns string containing the day of week (english-gregorian)
es: devuelve una cadena con el día de la semana (inglés, gregoriano)

source: Returns a string containing the abbreviated day of week (english-gregorian)
es: devuelve una cadena con el día de la semana abreviado (inglés, gregoriano)

source: Returns a string containing a month name. mode tells this function which calendar to convert the Julian Day Count to, and what type of month names are to be returned.
es: Devuelve una cadena que contiene el nombre del mes. modo le dice a esta función a qué calendario debe convertir la Cuenta de Días Juliana, y qué tipo de nombres de mes debe devolver.

source: Calendar modes
es: Modos de calendario

source: Values
es: Valores

source: Gregorian - abbreviated
es: Gregoriano - abreviado

source: Gregorian
es: Gregoriano

source: Julian - abbreviated
es: Juliano - abreviado

source: Julian
es: Juliano

source: Jewish
es: Judío

source: French Republican
es: Republicano Francés

source: Converts a Julian Day Count to the French Republican Calendar.
es: Convierte una Cuenta de Días Juliana al Calendario Republicano Francés.

source: Converts Julian Day Count to a string containing the Gregorian date in the format of "month / day / year".
es: Convierte de Cuenta de Días Juliana a una cadena que contiene la fecha Gregoriana en formato "mes / día / año"

source: Converts a Julian Day Count the the Jewish Calendar.
es: Convierte una Cuenta de Días Juliana al Calendario Judío.

source: Converts Julian Day Count to a string containing the Julian Calendar Date in the format of "month / day / year".
es: Convierte una Cuenta de Días Juliana a una cadena que contiene la fecha del Calendario Juliano en formato "mes / día / año".

source: This function will return a UNIX timestamp corresponding to the Julian Day given in jday or FALSE if jday is not inside the UNIX epoch (Gregorian years between 1970 and 2037 or 2440588 = jday = 2465342).
es: Esta funció devuelve el "UNIX timestamp" correspondiante a el dia Juliano definido en jday ó falso (FALSE) si jday no se encuentra en la época UNIX (años entre 1970 y 2037 ó 2440588 = jday = 2465342).

source: The time returned is localtime (and not GMT).
es: El tiempo devuelto es localtime (y no GMT).

source: See also unixtojd().
es: Ver también unixtojd().

source: Although this function can handle dates all the way back to the year 1 (3761 B.C.), such use may not be meaningful.
es: Aunque este programa puede manejar fechas tan lejanas como el año 1 (3761 A.C.), usarlo no tendría sentido.

source: The Jewish calendar has been in use for several thousand years, but in the early days there was no formula to determine the start of a month.
es: El Calendario Judío ha estado en uso miles de años, pero en los días primeros no había una fórmula que calculara el comienzo de un mes.

source: A new month was started when the new moon was first observed.
es: Un mes comenzaba cuando se veía por primera vez la luna nueva.

source: join() is an alias to implode(), and is identical in every way.
es: join() es un alias para implode(), y es idéntica en todo.

source: See also explode(), implode(), and split().
es: Vea también explode(), implode(), y split().

source: Valid Range for Julian Calendar 4713 B.C. to 9999 A.D.
es: Rango válido para el Calendario Juliano: del 4713 A.C al 9999 D.C.

source: Although this function can handle dates all the way back to 4713 B.C., such use may not be meaningful.
es: Aunque este programa puede manejar fechas tan lejanas como el 4713 A.C., usarlo no tendría sentido.

source: The calendar was created in 46 B.C., but the details did not stabilize until at least 8 A.D., and perhaps as late at the 4th century.
es: El calendario se creó en el 46 A.C., pero sus detalles no se estabilizaron hasta al menos el 8 D.C., y quizás no lo hiciera hasta el siglo IV.

source: Also, the beginning of a year varied from one culture to another - not all accepted January as the first month.
es: Además, el comienzo de un año variaba de una a otra cultura: no todas aceptaban enero como el primer mes.

source: Caution
es: Atención

source: Remember, the current calendar system being used worldwide is the Gregorian calendar. gregoriantojd() can be used to convert such dates to their Julian Day count.
es: Recordar que el actual sistema de calendario en uso en todo el mundo es el calendario Gregoriano. gregoriantojd() puede ser usada para convertir los dias del calendario Gregoriano a Cuenta de Días Juliana.

source: key() returns the index element of the current array position.
es: key() devuelve el elemento índice de la posición actual en la matriz.

source: See also current() and next().
es: Vea también: current(), next()

source: This is useful mainly for associative arrays.
es: Ordena una matriz por clave en orden inverso, manteniendo las correlaciones clave a dato.

source: $fruits = array ("d"= "lemon", "a"= "orange", "b"= "banana", "c"= "apple"); krsort ($fruits); reset ($fruits); while (list ($key, $val) = each ($fruits)) {echo "$key = $val\n";}
es: Ejemplo 1.

source: This example would display:
es: Ejemplo de krsort()

source: See also asort(), arsort(), ksort(), sort(), natsort(), and rsort().
es: Vea también: asort(), arsort(), ksort() sort(), y rsort().

source: $fruits = array ("d"= "lemon", "a"= "orange", "b"= "banana", "c"= "apple"); ksort ($fruits); reset ($fruits); while (list ($key, $val) = each ($fruits)) {echo "$key = $val\n";}
es: Esto es útil principalmente en matrices asociativas.

source: a = orange b = banana c = apple d = lemon
es: Ejemplo de ksort()

source: See also asort(), arsort(), krsort(), uksort(), sort(), natsort(), and rsort().
es: $frutas = array ("d"= "limón", "a"= "naranja", "b"= "plátano", "c"= "manzana"); ksort ($frutas); for (reset ($frutas); $clave = key ($frutas); next ($frutas)) {echo "frutas[$clave] = ".$frutas[$clave] ."\n";}

source: The second parameter was added in PHP 4.
es: Vea también: asort(), arsort(), sort(), y rsort().

source: The ldap_add() function is used to add entries in the LDAP directory.
es: La función ldap_add() se usa para añadir entradas o registros a un directorio LDAP.

source: The DN of the entry to be added is specified by dn.
es: El DN ("distinguished name", nombre distinguible, la referencia de cualquier entrada LDAP) es especificado por dn.

source: Array entry Array entry specifies the information about the entry.
es: El array entrada especifica la información que quiere añadirse.

source: The values in the entries are indexed by individual attributes.
es: Los valores del array son indexados por sus propios atributos.

source: In case of multiple values for an attribute, they are indexed using integers starting with 0.
es: En caso de valores múltiples para un mismo atributo, son indexados usando enteros empezando con 0.

source: entry[ "attribute1"] = value entry["attribute2"][0] = value1 entry["attribute2"][1] = value2
es: entry[ "atributo1"] = valor entry["atributo2"][0] = valor1 entry["atributo2"][1] = valor2

source: Complete example with authenticated bind
es: Ejemplo completo con login atentificado

source: ?php $ds=ldap_connect( "localhost"); / / assuming the LDAP server is on this host if ($ds) {/ / bind with appropriate dn to give update access $r=ldap_bind($ds ,"cn=root, o=My Company, c=US", "secret"); / / prepare data $info["cn"]="John Jones"; $info["sn"]="Jones"; $info["mail"]="jonj@here.and.now"; $info["objectclass"]="person"; / / add data to directory $r=ldap_add($ds, "cn=John Jones, o=My Company, c=US", $info); ldap_close($ds);} else {echo "Unable to connect to LDAP server";}?
es: ?php $ds=ldap_connect( "localhost"); / / Asumimos que el servidor LDAP está en el / / servidor local if ($ds) {/ / autentificarse con el dn apropiado para tener permisos de modificación $r=ldap_bind($ds ,"cn=root, o=Mi Compañia, c=ES", "secreto"); / / prepare data $info["cn"]="Pedro Pérez"; $info["sn"]="Pedro"; $info["mail"]="pedro.p@algun.sitio"; $info["objectclass"]="persona"; / / add data to directory $r=ldap_add($ds, "cn=Pedro Pérez, o=Mi Compañia, c=ES", $info); ldap_close($ds);} else {echo "Ha sido imposible conectar al servidor LDAP";}?

source: If not specified, anonymous bind is attempted.
es: Devuelve verdadero cuando finaliza correctamente y falso se produce un error.

source: Using LDAP Bind
es: ldap_bind() se conecta al directorio con un determinado usuario. rdn_de_usuario y contraseña son opcionales.

source: Using LDAP Bind Anonymously
es: Si no son especificados, se intenta el acceso anónimo.

source: This call is internally identical to ldap_unbind().
es: ldap_close() cierra la conexión con el servidor LDAP asociada con el identificador_de_conexion especificado.

source: The LDAP API uses the call ldap_unbind(), so perhaps you should use this in preference to ldap_close().
es: Esta llamada es idéntica internamente a ldap_unbind().

source: This function is an alias of ldap_unbind().
es: La API LDAP usa la llamada ldap_unbind(), y por lo tanto quizás deba usar esta llamada en lugar de ldap_close().

source: Both the arguments are optional.
es: Devuelve un identificador de conexión positivo en caso de éxito, ó falso si ocurre algún error.

source: If only hostname is specified, then the port defaults to 389.
es: ldap_connect() establece una conexión con el servidor LDAP especificado en nombre_host y puerto.

source: If you are using OpenLDAP 2.x.x you can specify a URL instead of the hostname.
es: Ambos argumentos son opcionales.

source: The port parameter is not used when using URLs.
es: Si no se especifican, el identificador de la conexión LDAP actualmente abierta es devuelto.

source: Example of connecting securely to LDAP server.
es: Si sólo es especificado nombre_host el puerto tomado por defecto es el 389.

source: Returns number of entries in the result or FALSE on error.
es: Devuelve el número de entradas del resultado o falso si ha ocurrido algún error.

source: ldap_count_entries() returns the number of entries stored in the result of previous search operations. result_identifier identifies the internal ldap result.
es: ldap_count_entries() devuelce el número de entradas almacenadas en el resultado de operaciones de búsqueda previas. identificador_de_resultado identifica el resultado ldap interno al que hacemos referencia.

source: ldap_delete() function delete a particular entry in LDAP directory specified by dn.
es: La función ldap_delete() borra la entrada particular dn del directorio LDAP.

source: ldap_dn2ufn() function is used to turn a DN, specified by dn, into a more user-friendly form, stripping off type names.
es: La función ldap_dn2ufn() es usada para convertir un DN en un formato más amigable para el usuario.

source: Returns string error message.
es: Devuelve una cadena con el mensaje de error.

source: This function returns the string error message explaining the error number errno.
es: Esta función devuelve una cadena con el mensaje de error explicativo del código numérico de error numerr.

source: While LDAP errno numbers are standardized, different libraries return different or even localized textual error messages.
es: Aunque los códigos de error LDAP están estandarizados, diferentes librerías devuelven mensajes textuales de error diferentes o incluso localizados.

source: Never check for a specific error message text, but always use an error number to check.
es: Nunca se debe comprobar la existencia de un error específico por el mensaje textual, sino por el código numérico.

source: See also ldap_errno() and ldap_error().
es: Var también ldap_errno() y ldap_error().

source: Enumerating all LDAP error messages
es: Enumerando todos los mensajes de error LDAP
